Revit 2027 API
ParameterTypeId.StructuralAnalyticalColumnHorizontalProjectionPlane Property
 "Horizontal Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAnalyticalColumnHorizontalProjectionPlane { get; }
Public Shared ReadOnly Property StructuralAnalyticalColumnHorizontalProjectionPlane As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAnalyticalColumnHorizontalProjectionPlane {
	ForgeTypeId^ get ();
}
static member StructuralAnalyticalColumnHorizontalProjectionPlane : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace